# Data Exploration!

This an Academic work on Data Exploration which is a part of pair-work with UmaMaheshwari (github name). Here in this analysis, we have used three datsets. 

Source of Data sets: https://my.pcloud.com/publink/show?code=kZAtF37Z2aPdBRKzyqS2kKOLAROWq7P6pIay

In [60]:
# packages import

import numpy as np
import pandas as pd

import warnings
warnings.simplefilter("ignore")

# Basic Info

Read the data-file (a 10 000 row subset of most rated IMDB-movies) into Pandas DataFrame and name the DataFrame-variable to df (use tab-character (\t) as the separator)

1. Use the following column-names: ID, title, year, rating, votes, duration, genres

2. Index the df with ID-column (either on reading the file or after it.)

3. Display first 5 rows of the df

4. Display last 11 rows of the df

5. Display the df-info

1 Naming the column

In [2]:
col_names=["ID", "title", "year", "rating", "votes", "duration", "genres"]

In [3]:
df = pd.read_csv("movie_data.txt", delimiter="\t", names=col_names)
df.head()

,ID,title,year,rating,votes,duration,genres
0,tt0111161,The Shawshank Redemption (1994),1994,9.2,619479,142 mins.,Crime|Drama
1,tt0110912,Pulp Fiction (1994),1994,9.0,490065,154 mins.,Crime|Thriller
2,tt0137523,Fight Club (1999),1999,8.8,458173,139 mins.,Drama|Mystery|Thriller
3,tt0133093,The Matrix (1999),1999,8.7,448114,136 mins.,Action|Adventure|Sci-Fi
4,tt1375666,Inception (2010),2010,8.9,385149,148 mins.,Action|Adventure|Sci-Fi|Thriller

2 Resetting Index

In [4]:
df = df.set_index("ID")
df.head()

,title,year,rating,votes,duration,genres
ID,,,,,,
tt0111161,The Shawshank Redemption (1994),1994,9.2,619479,142 mins.,Crime|Drama
tt0110912,Pulp Fiction (1994),1994,9.0,490065,154 mins.,Crime|Thriller
tt0137523,Fight Club (1999),1999,8.8,458173,139 mins.,Drama|Mystery|Thriller
tt0133093,The Matrix (1999),1999,8.7,448114,136 mins.,Action|Adventure|Sci-Fi
tt1375666,Inception (2010),2010,8.9,385149,148 mins.,Action|Adventure|Sci-Fi|Thriller

3 First five (5) rows

In [5]:
df.head(5)

,title,year,rating,votes,duration,genres
ID,,,,,,
tt0111161,The Shawshank Redemption (1994),1994,9.2,619479,142 mins.,Crime|Drama
tt0110912,Pulp Fiction (1994),1994,9.0,490065,154 mins.,Crime|Thriller
tt0137523,Fight Club (1999),1999,8.8,458173,139 mins.,Drama|Mystery|Thriller
tt0133093,The Matrix (1999),1999,8.7,448114,136 mins.,Action|Adventure|Sci-Fi
tt1375666,Inception (2010),2010,8.9,385149,148 mins.,Action|Adventure|Sci-Fi|Thriller

4 Last Eleven (11) rows

In [6]:
df.tail(11)

,title,year,rating,votes,duration,genres
ID,,,,,,
tt0101356,Another You (1991),1991,4.9,1359,98 mins.,Comedy|Crime
tt0421090,Zerophilia (2005),2005,6.3,1359,90 mins.,Comedy|Romance
tt0067227,The Merchant of Four Seasons (1971),1971,7.6,1359,88 mins.,Drama
tt0339727,Stateside (2004),2004,5.8,1358,97 mins.,Drama|Music|Romance
tt0218581,Scarlet Diva (2000),2000,5.2,1358,91 mins.,Drama
tt0118635,Aprile (1998),1998,6.7,1358,78 mins.,Comedy
tt0807721,Meduzot (2007),2007,7.0,1357,78 mins.,Drama
tt0339642,Daltry Calhoun (2005),2005,5.2,1357,100 mins.,Comedy|Drama|Music|Romance
tt0060880,The Quiller Memorandum (1966),1966,6.5,1356,104 mins.,Drama|Mystery|Thriller
tt0152836,Taal (1999),1999,6.5,1356,179 mins.,Musical|Romance
tt0279977,The Navigators (2001),2001,6.9,1356,96 mins.,Comedy|Drama

5 Information (info) of the dataset "df"

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, tt0111161 to tt0279977
Data columns (total 6 columns):
title       10000 non-null object
year        10000 non-null int64
rating      10000 non-null float64
votes       10000 non-null int64
duration    10000 non-null object
genres      9999 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 546.9+ KB

# Cleaning

1. Drop all the missing rows which contain any column with missing data
2. Convert the duration column to numerical representation of seconds
3. Remove the year from title column

1. Searching for missing value and dropping them

In [8]:
# Looking for missing values from whole data set
#df.isnull()

It is quite impossible to find out any missing value from the whole data set by using isnull(). Because there is a visibility problem to find the missing value from this bunch of data set. However, there is a way to get information about the missing value from the info() syntax. Let´s see that.

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, tt0111161 to tt0279977
Data columns (total 6 columns):
title       10000 non-null object
year        10000 non-null int64
rating      10000 non-null float64
votes       10000 non-null int64
duration    10000 non-null object
genres      9999 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 546.9+ KB

From the information of the data set by using info(), we can see that almost all of the variable have no missing value except "genres". Let´s dig deep...

In [10]:
#df

In [11]:
#df["genres"].isnull()
df[df["genres"].isnull()]

                      title  year  rating  votes  duration genres
ID
tt0990404  Chop Shop (2007)  2007     7.2   2104  84 mins.    NaN

Here, we can see there is a missing value in "genres".

Dropping the missing value

In [12]:
df = df.dropna()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9999 entries, tt0111161 to tt0279977
Data columns (total 6 columns):
title       9999 non-null object
year        9999 non-null int64
rating      9999 non-null float64
votes       9999 non-null int64
duration    9999 non-null object
genres      9999 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 546.8+ KB

2. Converting the duration column to numerical representation of seconds

In [13]:
df["duration"] = df["duration"].apply(lambda x : int(x.replace("mins.","")))
df["duration"]=df["duration"]*60

In [14]:
df.head()

,title,year,rating,votes,duration,genres
ID,,,,,,
tt0111161,The Shawshank Redemption (1994),1994,9.2,619479,8520,Crime|Drama
tt0110912,Pulp Fiction (1994),1994,9.0,490065,9240,Crime|Thriller
tt0137523,Fight Club (1999),1999,8.8,458173,8340,Drama|Mystery|Thriller
tt0133093,The Matrix (1999),1999,8.7,448114,8160,Action|Adventure|Sci-Fi
tt1375666,Inception (2010),2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller

3. Removing the year from title column

In [15]:
df["title"] = df["title"].str.slice(0,-7)
#or
#df["title"] = df["title"].apply(lambda x:)

In [16]:
df.head()

,title,year,rating,votes,duration,genres
ID,,,,,,
tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama
tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller
tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller
tt0133093,The Matrix,1999,8.7,448114,8160,Action|Adventure|Sci-Fi
tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller

In [17]:
df = df.reset_index()
df.head()

,ID,title,year,rating,votes,duration,genres
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller
2,tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller
3,tt0133093,The Matrix,1999,8.7,448114,8160,Action|Adventure|Sci-Fi
4,tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller

# Concatenating

1. Read crew_data.tsv.gz to DataFrame named movie_crew_df with columns ID, director_ids indexed by ID (forget the rest of the columns)
2. Read person_data.tsv.gz to DataFrame named person_df with columns person_ID, name indexed by person_ID (forget the rest of the columns)
3. Merge movie_crew_df into df with IDs and drop the columns without necessary data (hint outer-join)
4. Remove movies with more than one director and rename director_ids => director_id
5. Merge df with person_df on director_id, remove director_id and person_ID columns, rename name => director

1. Read crew_data.tsv.gz to DataFrame named movie_crew_df with columns ID, director_ids indexed by ID (forget the rest of the columns)

In [18]:
# Crew data
movie_crew_df = pd.read_csv("crew_data.tsv", delimiter="\t", names=["ID","director_ids"], 
                            usecols=(0,1), header=0)
movie_crew_df = movie_crew_df.set_index("ID")
movie_crew_df = movie_crew_df.reset_index()
movie_crew_df.head()

          ID director_ids
0  tt0000001    nm0005690
1  tt0000002    nm0721526
2  tt0000003    nm0721526
3  tt0000004    nm0721526
4  tt0000005    nm0005690

2. Read person_data.tsv.gz to DataFrame named person_df with columns person_ID, name indexed by person_ID (forget the rest of the columns)

In [19]:
person_df = pd.read_csv("name_data.tsv", delimiter="\t", names=["person_ID","name"],usecols=(0,1), header=0, 
                        index_col="person_ID")

In [20]:
person_df.head()

                      name
person_ID
nm0000001     Fred Astaire
nm0000002    Lauren Bacall
nm0000003  Brigitte Bardot
nm0000004     John Belushi
nm0000005   Ingmar Bergman

In [21]:
person_df=person_df.reset_index()
person_df.head(5)

   person_ID             name
0  nm0000001     Fred Astaire
1  nm0000002    Lauren Bacall
2  nm0000003  Brigitte Bardot
3  nm0000004     John Belushi
4  nm0000005   Ingmar Bergman

3. Merge movie_crew_df into df with IDs and drop the columns without necessary data (hint outer-join)

In [22]:
movie_crew_df.head(5)

          ID director_ids
0  tt0000001    nm0005690
1  tt0000002    nm0721526
2  tt0000003    nm0721526
3  tt0000004    nm0721526
4  tt0000005    nm0005690

In [23]:
df.head(5)

,ID,title,year,rating,votes,duration,genres
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller
2,tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller
3,tt0133093,The Matrix,1999,8.7,448114,8160,Action|Adventure|Sci-Fi
4,tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller

In [24]:
merge_movie_crew_and_df = pd.merge(movie_crew_df,df, how="outer", on="ID")

In [25]:
merge_movie_crew_and_df.head()

          ID director_ids title  year  rating  votes  duration genres
0  tt0000001    nm0005690   NaN   NaN     NaN    NaN       NaN    NaN
1  tt0000002    nm0721526   NaN   NaN     NaN    NaN       NaN    NaN
2  tt0000003    nm0721526   NaN   NaN     NaN    NaN       NaN    NaN
3  tt0000004    nm0721526   NaN   NaN     NaN    NaN       NaN    NaN
4  tt0000005    nm0005690   NaN   NaN     NaN    NaN       NaN    NaN

In [26]:
merge_movie_crew_and_df_dropna = merge_movie_crew_and_df.dropna()
merge_movie_crew_and_df_dropna.head()

,ID,director_ids,title,year,rating,votes,duration,genres
34819,tt0035423,nm0003506,Kate & Leopold,2001.0,6.2,26738.0,7080.0,Comedy|Fantasy|Romance
41011,tt0041719,nm0168413,Orpheus,1950.0,8.0,3561.0,5700.0,Fantasy|Drama|Romance
41219,tt0041931,nm0744023,Stromboli,1950.0,7.1,1527.0,6420.0,Drama
41461,tt0042179,nm0006943,Abbott and Costello in the Foreign Legion,1950.0,6.3,1722.0,4800.0,Adventure|Comedy
41474,tt0042192,nm0000581,All About Eve,1950.0,8.5,39729.0,8280.0,Drama

4. Remove movies with more than one director and rename director_ids => director_id

In [27]:
merge_movie_crew_and_df_after_director = merge_movie_crew_and_df_dropna[merge_movie_crew_and_df_dropna["director_ids"].str.len()==9]

In [28]:
merge_movie_crew_and_df_after_director.head()

,ID,director_ids,title,year,rating,votes,duration,genres
34819,tt0035423,nm0003506,Kate & Leopold,2001.0,6.2,26738.0,7080.0,Comedy|Fantasy|Romance
41011,tt0041719,nm0168413,Orpheus,1950.0,8.0,3561.0,5700.0,Fantasy|Drama|Romance
41219,tt0041931,nm0744023,Stromboli,1950.0,7.1,1527.0,6420.0,Drama
41461,tt0042179,nm0006943,Abbott and Costello in the Foreign Legion,1950.0,6.3,1722.0,4800.0,Adventure|Comedy
41474,tt0042192,nm0000581,All About Eve,1950.0,8.5,39729.0,8280.0,Drama

In [29]:
merge_movie_crew_and_df_after_director = merge_movie_crew_and_df_after_director.rename(columns={'director_ids':'director_id'})

5. Merge df with person_df on director_id, remove director_id and person_ID columns, rename name => director

In [30]:
df.head(2)

,ID,title,year,rating,votes,duration,genres
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller

In [31]:
person_df.head(2)

   person_ID           name
0  nm0000001   Fred Astaire
1  nm0000002  Lauren Bacall

In [32]:
merging = pd.merge(movie_crew_df, person_df, left_on='director_ids',right_on="person_ID", how='inner')

In [33]:
merging.head()

          ID director_ids  person_ID                  name
0  tt0000001    nm0005690  nm0005690  William K.L. Dickson
1  tt0000005    nm0005690  nm0005690  William K.L. Dickson
2  tt0000006    nm0005690  nm0005690  William K.L. Dickson
3  tt0000008    nm0005690  nm0005690  William K.L. Dickson
4  tt0000036    nm0005690  nm0005690  William K.L. Dickson

In [34]:
# Dropping 
merging = merging.drop(["director_ids","person_ID"],axis=1)
merging.head()

          ID                  name
0  tt0000001  William K.L. Dickson
1  tt0000005  William K.L. Dickson
2  tt0000006  William K.L. Dickson
3  tt0000008  William K.L. Dickson
4  tt0000036  William K.L. Dickson

In [35]:
# Remaning name > director
merging = merging.rename(columns={'name':'director'})

# Exploration

1. Find ten most longest movies
2. Find Best rated movies ordered by rating DESC and Title ASC
3. What is the average duration (in minutes) of a movie?
4. Get ten most productive directors
5. How many movie has been made in the 2000's?
6. Get all the movies directed by Akira Kurosawa ordered by year DESC

In [36]:
df.head(5)

,ID,title,year,rating,votes,duration,genres
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller
2,tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller
3,tt0133093,The Matrix,1999,8.7,448114,8160,Action|Adventure|Sci-Fi
4,tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller

1. Find ten most longest movies

In [37]:
df.nlargest(10, ['duration'])

,ID,title,year,rating,votes,duration,genres
6908,tt0111341,Satantango,1994,8.5,2698,27000,Comedy|Drama|Mystery
6738,tt0063794,War and Peace,1967,7.8,2833,25620,Drama|History|Romance|War
2936,tt0107007,Gettysburg,1993,7.7,12093,15660,Drama|History|War
2086,tt0116477,Hamlet,1996,7.7,19698,14520,Crime|Drama|Romance|Thriller
8348,tt1128075,Love Exposure,2008,8.0,1922,14220,Action|Comedy|Drama|Romance
7036,tt0101428,La Belle Noiseuse,1991,7.6,2621,14160,Drama
9216,tt0068883,Ludwig,1972,7.6,1581,14100,Biography|Drama|History
384,tt0087843,Once Upon a Time in America,1984,8.4,85533,13740,Crime|Drama
2647,tt0169102,Lagaan: Once Upon a Time in India,2001,8.1,14190,13440,Drama|Musical|Romance|Sport
1839,tt0049833,The Ten Commandments,1956,7.9,22789,13200,Adventure|Drama|History

2. Find Best rated movies ordered by rating DESC and Title ASC

In [38]:
df[['title', 'rating']].sort_values(by=['rating'], ascending=False).head(10)

                                title  rating
0            The Shawshank Redemption     9.2
26                      The Godfather     9.2
3386                 Outrageous Class     9.0
37             The Godfather: Part II     9.0
85     The Good, the Bad and the Ugly     9.0
1                        Pulp Fiction     9.0
25                    The Dark Knight     8.9
143                      12 Angry Men     8.9
44    One Flew Over the Cuckoo's Nest     8.9
4                           Inception     8.9

3. What is the average duration (in minutes) of a movie?

In [39]:
mean_duration =round(df['duration'].mean(),3)/60
print("Average value of duration is {}min.".format(mean_duration))

Average value of duration is 103.58035min.

4. Get ten most productive directors

In [40]:
# Multiplying rating and votes
df['R_x_v'] = df['rating'] * df['votes']

In [41]:
# using the 'R_x_v' column find the most productive director
director=df[[ 'R_x_v']].sort_values(by=['R_x_v'], ascending=False)

In [42]:
director.head(10)

        R_x_v
0   5699206.8
25  4940585.8
1   4410585.0
26  4362538.8
2   4031922.4
27  3971114.4
3   3898591.8
28  3773360.8
4   3427826.1
29  3333083.1

5. How many movie has been made in the 2000's?

In [43]:
#movie has been made in the 2000's
movie=(df['year']>1999) & (df['year']<2010)

In [57]:
#df[movie]

In [44]:
movie.agg('sum')

4173

In [45]:
#all the movies directed by Akira Kurosawa
#Akira_movie=marge_person [merge_person['director']== 'Akira Kurosawa']

In [55]:
df.head()

,ID,title,year,rating,votes,duration,genres,R_x_v
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama,5699206.8
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller,4410585.0
2,tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller,4031922.4
3,tt0133093,The Matrix,1999,8.7,448114,8160,Action|Adventure|Sci-Fi,3898591.8
4,tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller,3427826.1

In [56]:
movie_crew_df.head()

          ID director_ids
0  tt0000001    nm0005690
1  tt0000002    nm0721526
2  tt0000003    nm0721526
3  tt0000004    nm0721526
4  tt0000005    nm0005690

In [58]:
merging.head()

          ID              director
0  tt0000001  William K.L. Dickson
1  tt0000005  William K.L. Dickson
2  tt0000006  William K.L. Dickson
3  tt0000008  William K.L. Dickson
4  tt0000036  William K.L. Dickson

In [46]:
di_year= pd.merge(df,movie_crew_df,how='inner', on='ID')

In [47]:
di_year_1=pd.merge(di_year,merging,how= 'inner' ,on='ID')

In [48]:
di_year_1.head()

,ID,title,year,rating,votes,duration,genres,R_x_v,director_ids,director
0,tt0111161,The Shawshank Redemption,1994,9.2,619479,8520,Crime|Drama,5699206.8,nm0001104,Frank Darabont
1,tt0110912,Pulp Fiction,1994,9.0,490065,9240,Crime|Thriller,4410585.0,nm0000233,Quentin Tarantino
2,tt0137523,Fight Club,1999,8.8,458173,8340,Drama|Mystery|Thriller,4031922.4,nm0000399,David Fincher
3,tt1375666,Inception,2010,8.9,385149,8880,Action|Adventure|Sci-Fi|Thriller,3427826.1,nm0634240,Christopher Nolan
4,tt0109830,Forrest Gump,1994,8.7,368994,8520,Comedy|Drama|Romance,3210247.8,nm0000709,Robert Zemeckis

6. Get all the movies directed by Akira Kurosawa ordered by year DESC

In [49]:
#all the movies directed by Akira Kurosawa ordered by year DESC
Akira_movie=di_year_1 [di_year_1['director']== 'Akira Kurosawa']

In [50]:
x=Akira_movie[['title','year','director']].sort_values(['year'], ascending=False)

In [51]:
x.head()

                   title  year        director
7872            Madadayo  1993  Akira Kurosawa
6370  Rhapsody in August  1991  Akira Kurosawa
992                  Ran  1985  Akira Kurosawa
2703           Kagemusha  1980  Akira Kurosawa
3269         Dersu Uzala  1975  Akira Kurosawa

In [52]:
x.drop_duplicates()

                    title  year        director
7872             Madadayo  1993  Akira Kurosawa
6370   Rhapsody in August  1991  Akira Kurosawa
992                   Ran  1985  Akira Kurosawa
2703            Kagemusha  1980  Akira Kurosawa
3269          Dersu Uzala  1975  Akira Kurosawa
7010         Dodes'ka-den  1970  Akira Kurosawa
4368            Red Beard  1965  Akira Kurosawa
3459         High and Low  1963  Akira Kurosawa
3193              Sanjuro  1962  Akira Kurosawa
1116              Yojimbo  1961  Akira Kurosawa
5818   The Bad Sleep Well  1960  Akira Kurosawa
2677  The Hidden Fortress  1958  Akira Kurosawa
7906     The Lower Depths  1957  Akira Kurosawa
2568      Throne of Blood  1957  Akira Kurosawa
9436       I Live in Fear  1955  Akira Kurosawa
190         Seven Samurai  1954  Akira Kurosawa
1993                Ikiru  1952  Akira Kurosawa
8465            The Idiot  1951  Akira Kurosawa
785              Rashomon  1950  Akira Kurosawa